Ran Plan for project: `localfile` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.aws_ami.amazon_linux: Read complete after 1s [id=ami-0da6daf1cd16df4e7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.demo_ec2 will be created
+ resource "aws_instance" "demo_ec2" {
      + ami                                  = "ami-0da6daf1cd16df4e7"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "demsemoooooooooooo"
        }
      + tags_all                             = {
          + "Name" = "demsemoooooooooooo"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "a23cfe0e02fea70e7d7d684540123713e4d7e0a8"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-00b24d3ea73ba58fb",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
~ instance_public_ip = "13.203.206.116" -> (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p localfile`
* :put_litter_in_its_place: To **delete** this plan click [here](http://16.171.236.23:4141/lock?id=Himanshi280%252Fatl%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p localfile`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
